//задание на 153 странице
for (var i=0; i<5;i++){
   $("h1").fadeOut(1000);
   $("h1").fadeIn(1000);
}

//1 задание на 155 странице
//var imena=["Яна","Катя","Аня","Алина"];
//$("h1").fadeOut(1000);
//$("h1").fadeIn(1000);
//for (var i=0; i<4;i++){
   //$("body").append("<p>"+imena[i]+" лучшая!"+"</p>") ;

//}
//$("p").hide();
//$("p").fadeIn(1000);

//2 задание на 155 странице
//for (var i = 0; i < 5; i++) {
   //fadeTime = (i + 1) * 1000;
   //$("h1").fadeOut(fadeTime / 2).fadeIn(fadeTime / 2);
// }

//3 задание на 155 странице??????
//$("h1").fadeOut(1000).delay(5000).fadeIn(1000);

//4 задание на 155 странице??????
//$("h1").fadeTo(2000, 0.3);